# Taps
tap 'github/gh'
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap 'homebrew/cask-fonts'
tap 'homebrew/services'


# GNU Utils
# From https://gist.github.com/skyzyx/3438280b18e4f7c490db8a2a2ca0b9da
brew 'autoconf'
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'flex'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'
brew 'screen'
brew 'watch'
brew 'wdiff'
brew 'wget'


# General Formulae
brew 'bat'
brew 'cmake'
brew 'delta'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'jq'
brew 'neovim'
brew 'openssh'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'shellcheck'
brew 'ssldump'
brew 'starship'
brew 'tcpdump'
brew 'telnet'
brew 'tldr'


# General Casks
cask 'alacritty'
cask 'google-chrome'
cask '1password'
cask 'docker'
cask 'slack'
cask 'spotify'
cask 'font-fira-code'
cask 'font-jetbrains-mono'