# Taps
tap 'github/gh'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# GNU Utils
# From https://gist.github.com/skyzyx/3438280b18e4f7c490db8a2a2ca0b9da
brew 'autoconf'
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'flex'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'
brew 'screen'
brew 'watch'
brew 'wdiff'
brew 'wget'


# Programming langs
brew 'go'
brew 'node'
brew 'python'
brew 'rustup-init'

# Formulae
brew 'ack'
brew 'bash-completion'
brew 'bat'
brew 'cmake'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'openssh'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'shellcheck'
brew 'starship'
brew 'ssldump'
brew 'tcpdump'
brew 'telnet'
brew 'tldr'
brew 'delta'

# Casks
cask 'google-chrome'
cask '1password'
cask 'docker'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'wire'
cask 'wireshark'
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-inter'
cask 'font-jetbrains-mono'

# Mac App Store Applications
# mas 'APPID'
